import { IOption } from 'root-front/dist/types';

export const myAllWorkTime: IOption[] = [
  {
    value: 'main40',
    label: 'НОРМАТИВНЫЙ 40 часов'
  },
  {
    value: 'second40',
    label: 'второстепенный 40 часов'
  }
];
export const causeMock: IOption[] = [
  {
    value: '0',
    label: 'Изменения индивидуального графика работы'
  },
  {
    value: '1',
    label: 'Неполная занятость по соглашению ворон'
  },
  {
    value: '2',
    label: 'Неполная занятость (я ленивый)'
  },
  {
    value: '3',
    label: 'Неполная занятость (ребенок до 40 лет)'
  }
];

export const myAllWorkTime_sap: any = {
  '@odata.context': '$metadata#IAllWorkTime',
  '@odata.metadataEtag': 'W/"20201112064604"',
  value: [
    {
      value: 'N35N0000',
      label: 'НОРМАТИВНЫЙ 35 часов'
    },
    {
      value: 'N35N0001',
      label: '35(сокращРВ,09:00-16:45)'
    },
    {
      value: 'N35R0000',
      label: '35(СРВ,09:00-17:00,пт15:)'
    },
    {
      value: 'N35R0001',
      label: '35(сокращРВ,08:30-16:30)'
    },
    {
      value: 'N35R0002',
      label: 'СРВпн-чт:1000-1800пт1645'
    },
    {
      value: 'N36N0000',
      label: 'НОРМАТИВНЫЙ 36 часов'
    },
    {
      value: 'N36N0001',
      label: '36(женщ09:00-17:00)'
    },
    {
      value: 'N36R0002',
      label: 'НРВ_36 пн-чт:09.00-17.00'
    },
    {
      value: 'N40N0000',
      label: 'НОРМАТИВНЫЙ 40 часов'
    },
    {
      value: 'N40N0001',
      label: '40(09:00-18:00,обед60мин)'
    },
    {
      value: 'N40N0002',
      label: 'Норм 40 Легкий труд'
    },
    {
      value: 'N40N0003',
      label: '40(09:30-18:00,обед30мин)'
    },
    {
      value: 'N40N0004',
      label: 'НРВ(09:15-17:30)'
    },
    {
      value: 'N40N0005',
      label: '40(08:30-17:00,обед30мин)'
    },
    {
      value: 'N40N0006',
      label: '40(08:15-17:00)'
    },
    {
      value: 'N40N0007',
      label: 'НРВ(пн-пт10:15-17:00)'
    },
    {
      value: 'N40N0008',
      label: '40(10:15-19:00)'
    },
    {
      value: 'N40N0009',
      label: 'НРВ(07:30-11:30)'
    },
    {
      value: 'N40N0010',
      label: 'НРВ(09:00-13:45)'
    },
    {
      value: 'N40N0011',
      label: 'НРВ(09:00-15:00)'
    },
    {
      value: 'N40N0012',
      label: 'НРВ(09:00-16:12,пт15:12)'
    },
    {
      value: 'N40N0013',
      label: 'НРВ(пн,ср,чт,пт09:00-18:)'
    },
    {
      value: 'N40N0014',
      label: 'НРВ(12:00-17:45)'
    },
    {
      value: 'N40N0015',
      label: 'НРВ(09:00-15:00)'
    },
    {
      value: 'N40N0016',
      label: 'НРВ(09:00-17:00)'
    },
    {
      value: 'N40N0017',
      label: 'НРВ(пн,вт,ср 09:00-38:00)'
    },
    {
      value: 'N40N0018',
      label: 'НВР(пн-ср,пт13:00-20:00)'
    },
    {
      value: 'N40N0019',
      label: 'НРВ(пн,вт,чт08:00-19:00)'
    },
    {
      value: 'N40N0020',
      label: 'НРВ(вт-пт13:00-18:00)'
    },
    {
      value: 'N40N0021',
      label: 'НРВ(08:00-15:00)'
    },
    {
      value: 'N40N0022',
      label: 'НРВ(09:00-17:00)'
    },
    {
      value: 'N40N0023',
      label: '40(09:00-14:00)'
    },
    {
      value: 'N40N0024',
      label: 'НРВ,КРМначРД(09:15-17:30)'
    },
    {
      value: 'N40N0025',
      label: 'НРВ,КРМконРД(09:15-17:30)'
    },
    {
      value: 'N40N0026',
      label: 'НРВ,КРМначРД(09:00-13:30)'
    },
    {
      value: 'N40N0027',
      label: 'НРВ,КРМконРД(09:00-13:30)'
    },
    {
      value: 'N40N0028',
      label: '40,КРМначРД(09:00-18:00)'
    },
    {
      value: 'N40N0029',
      label: '40,КРМконРД(09:00-18:00)'
    },
    {
      value: 'N40N0030',
      label: 'НРВ,КРМначРД(12:00-17:45)'
    },
    {
      value: 'N40N0031',
      label: 'НРВ,КРМконРД(12:00-17:45)'
    },
    {
      value: 'N40N0032',
      label: '40,КРМначРД(10:00-19:00)'
    },
    {
      value: 'N40N0033',
      label: '40,КРМконРД(10:00-19:00)'
    },
    {
      value: 'N40N0034',
      label: 'НРВ,КРМначРД(08:00-16:00)'
    },
    {
      value: 'N40N0035',
      label: 'НРВ,КРМконРД(08:00-16:00)'
    },
    {
      value: 'N40N0036',
      label: 'Неп.раб.день 10 ч/неделю'
    },
    {
      value: 'N40N0037',
      label: 'Неп.раб.нед. 37,5 ч/нед.'
    },
    {
      value: 'N40N0038',
      label: '36,25ч/нед9:00-17:00пн-пт'
    },
    {
      value: 'N40N0041',
      label: 'Неп.раб.день 15ч/нед'
    },
    {
      value: 'N40N0043',
      label: 'НРВ,КРМконРД(10:00-17:45)'
    },
    {
      value: 'N40N0044',
      label: 'Неп.раб.день 30ч/в неделю'
    },
    {
      value: 'N40N0045',
      label: 'НРВ,КРМконРД(13:00-18:00)'
    },
    {
      value: 'N40N0046',
      label: '5д 5ч (12:00-17:45) Корм'
    },
    {
      value: 'N40N0047',
      label: 'Офис (09.15-15.00)'
    },
    {
      value: 'N40N0048',
      label: 'ПнПт09:45-17:45;30мин;'
    },
    {
      value: 'N40N0049',
      label: 'Пн-Пт10:00-15:15;45;30о'
    },
    {
      value: 'N40N0050',
      label: 'НРВ 20 часов(10:00-14:00)'
    },
    {
      value: 'N40N0051',
      label: '20ч;  10:00-14:45;  45м;'
    },
    {
      value: 'N40N0052',
      label: '35ч;14:15-22:00;45м;'
    },
    {
      value: 'N40N0053',
      label: '4х8ч15м; 09:00-18:00; 45м'
    },
    {
      value: 'N40N0054',
      label: 'НРВ,КРМконРД(10:00-14:45)'
    },
    {
      value: 'N40N0055',
      label: 'Пн-Пт.12:00-18:15,45,30о'
    },
    {
      value: 'N40N0056',
      label: '10:00-15:45,45,ПтВсВых'
    },
    {
      value: 'N40N0057',
      label: 'НРВ_офис (09.00-15.45)'
    },
    {
      value: 'N40N0058',
      label: '25ч/н, 09:00-14:45, 45м'
    },
    {
      value: 'N40N0059',
      label: 'Офис (09.00-18.00),пн вых'
    },
    {
      value: 'N40N0060',
      label: 'НРВ_1ч/нед (09:00-09:12)'
    },
    {
      value: 'N40N0061',
      label: 'Офис (пн-пн:11.00-17:00)'
    },
    {
      value: 'N40N0062',
      label: '20 (13:00-17:00)'
    },
    {
      value: 'N40N0063',
      label: 'Пн-Пт 10:00-18:00 60'
    },
    {
      value: 'N40N0064',
      label: '20(09:00-14:00)обед60мин'
    },
    {
      value: 'N40N0065',
      label: '20(09:00-14:00, обед60ми)'
    },
    {
      value: 'N40N0066',
      label: 'НРВ_офис пн-пт09:00-16:30'
    },
    {
      value: 'N40N0067',
      label: 'Пн-Пт 09:00-13:00'
    },
    {
      value: 'N40N0068',
      label: 'НРВ_оф6ч(9-15:30)30,1корм'
    },
    {
      value: 'N40N0069',
      label: 'НРВпн-пт 09:00-13:30'
    },
    {
      value: 'N40N0070',
      label: 'НРВ,КРМ(вт-пт10.00-17.00)'
    },
    {
      value: 'N40R0000',
      label: '40(08:30-17:30,пт16:15)'
    },
    {
      value: 'N40R0001',
      label: '40(09:30-18:30,пт17:15)'
    },
    {
      value: 'N40R0002',
      label: '40(10:00-19:00,пт17:45)'
    },
    {
      value: 'N40R0003',
      label: '40(08:00-17:00,пт15:45)'
    },
    {
      value: 'N40R0004',
      label: '40(09:15-18:15,пт17:00)'
    },
    {
      value: 'N40R0005',
      label: '40(07:00-16:00,пт14:45)'
    },
    {
      value: 'N40R0006',
      label: '40(09:00-18:00,пт16:45)'
    },
    {
      value: 'N40R0007',
      label: '40(08:40-17:40,пт16:25)'
    },
    {
      value: 'N40R0008',
      label: '40(индивид смешаннГР)'
    },
    {
      value: 'N40R0009',
      label: '40(09:45-18:45,пт17:30)'
    },
    {
      value: 'N40R0010',
      label: '40(15:00-24:00,пт22:45)'
    },
    {
      value: 'N40R0011',
      label: '40(08:45-17:45,пт16:30)'
    },
    {
      value: 'N40R0012',
      label: '40(07:30-16:30,пт15:15)'
    },
    {
      value: 'N40R0013',
      label: '40(08:30-17:30,пт16:45)'
    },
    {
      value: 'N40R0014',
      label: '40(10:00-19:00,пт17:45)'
    },
    {
      value: 'N40R0015',
      label: 'НРВ(10:00-18:00,пт17:00)'
    },
    {
      value: 'N40R0016',
      label: 'НРВ(09:00-18:00,пт15:45)'
    },
    {
      value: 'N40R0017',
      label: '40(09:00,10:00-18:00,19:)'
    },
    {
      value: 'N40R0018',
      label: 'НРВ(09:00-16:10,пт15:05)'
    },
    {
      value: 'N40R0019',
      label: '40(08:15-17:15,пт16:00)'
    },
    {
      value: 'N40R0020',
      label: '40(10:30-19:30,пт18:15)'
    },
    {
      value: 'N40R0021',
      label: '40(09:45-18:45,пт16:45)'
    },
    {
      value: 'N40R0022',
      label: '40(08:45-17:45,пт16:30)'
    },
    {
      value: 'N40R0023',
      label: '40(11:00-20:00,пт18:45)'
    },
    {
      value: 'N40R0024',
      label: '40(09:20-18:20,пт17:05)'
    },
    {
      value: 'N40R0025',
      label: '40(08:20-17:10,пт16:45)'
    },
    {
      value: 'N40R0026',
      label: '40(10:15-19:15,пт18:00)'
    },
    {
      value: 'N40R0027',
      label: '40(07:15-16:15,пт15:00)'
    },
    {
      value: 'N40R0028',
      label: '40(10:00,09:00-19:00,18:)'
    },
    {
      value: 'N40R0029',
      label: '40(09:00,15:00-18:00,24:)'
    },
    {
      value: 'N40R0030',
      label: '40(11:00,10:30-20:00,18:)'
    },
    {
      value: 'N40R0031',
      label: '40(09:25-18:25,пт17:10)'
    },
    {
      value: 'N40R0032',
      label: '40(09:15-18:15,пт17:00)'
    },
    {
      value: 'N40R0033',
      label: '40(09:10-18:05,пт17:15)'
    },
    {
      value: 'N40R0034',
      label: '40(11:30-20:30,пт19:15)'
    },
    {
      value: 'N40R0036',
      label: 'НРВ(пн,ср,чт09:00-18:00)'
    },
    {
      value: 'N40R0037',
      label: '40(12:00-21:00,пт19:45)'
    },
    {
      value: 'N40R0038',
      label: '40(09:00,08:20-18:00,17:)'
    },
    {
      value: 'N40R0039',
      label: 'НРВ(пн,ср,пт09:00-18:16:)'
    },
    {
      value: 'N40R0040',
      label: '40(09:00,10:00-18:19:17:)'
    },
    {
      value: 'N40R0041',
      label: '40(08:50-17:50,пт16:35)'
    },
    {
      value: 'N40R0042',
      label: '40(09:45,10:45-18:45,18:)'
    },
    {
      value: 'N40R0043',
      label: '40(09:30-18:30,пт16:45)'
    },
    {
      value: 'N40R0044',
      label: 'НРВ(пн,вт,ср09:00-14:00)'
    },
    {
      value: 'N40R0045',
      label: '40(09:00,15:00-18:00,24:)'
    },
    {
      value: 'N40R0046',
      label: 'НРВ(пн-ср09:00-18:,чт17:)'
    },
    {
      value: 'N40R0047',
      label: 'НРВ(09:00-16:45,пт15:45)'
    },
    {
      value: 'N40R0048',
      label: '40(11:30-19:30,обед30мин)'
    },
    {
      value: 'N40R0049',
      label: '40(08:20-17:20,пт16:05)'
    },
    {
      value: 'N40R0050',
      label: '40(08:00-16:45,пн15:30)'
    },
    {
      value: 'N40R0051',
      label: 'НРВ(09:00-18:00,пт16:15)'
    },
    {
      value: 'N40R0052',
      label: '40(09:40-18:40,пт17:25)'
    },
    {
      value: 'N40R0053',
      label: 'НРВ(10:00-18:30,пт17:30)'
    },
    {
      value: 'N40R0054',
      label: 'НРВ(09:00-15:00,пт14:48)'
    },
    {
      value: 'N40R0055',
      label: 'НРВ(09:00-17:00,пт16:45)'
    },
    {
      value: 'N40R0056',
      label: 'НРВ(09:00-16:00,пт15:45)'
    },
    {
      value: 'N40R0057',
      label: 'НРВ(вт,ср,чт09:00-18:00)'
    },
    {
      value: 'N40R0058',
      label: 'НРВ(09:00-15:00,пн15:30)'
    },
    {
      value: 'N40R0059',
      label: 'НРВ(09:00-16:00,пт14:45)'
    },
    {
      value: 'N40R0060',
      label: 'НРВ(пн,вт,ср09:-17:,13:)'
    },
    {
      value: 'N40R0061',
      label: 'НРВ(09:15-17:00)'
    },
    {
      value: 'N40R0062',
      label: 'НРВ(09:00-14:00,чт,пт13:)'
    },
    {
      value: 'N40R0063',
      label: 'НРВ(пн-чт09:00-18:30)'
    },
    {
      value: 'N40R0064',
      label: 'НРВ(09:00-17:00,пт16:00)'
    },
    {
      value: 'N40R0065',
      label: 'НРВ(09:00-18:00,пт14:00)'
    },
    {
      value: 'N40R0066',
      label: 'НРВ(08:00-15:00,пт13:-18:'
    },
    {
      value: 'N40R0067',
      label: 'НРВ(13:00-18:00,пт13:00)'
    },
    {
      value: 'N40R0068',
      label: 'НРВ(09:00-18:00,пт15:30)'
    },
    {
      value: 'N40R0069',
      label: 'НРВ(09:00-13:00,пт11:00)'
    },
    {
      value: 'N40R0070',
      label: 'НРВ(09:00-18:00,09:00-17:'
    },
    {
      value: 'N40R0071',
      label: 'НРВ(09:00-12:30,пт11:00)'
    },
    {
      value: 'N40R0072',
      label: 'НРВ(09:00-17:00,пт15:45)'
    },
    {
      value: 'N40R0073',
      label: 'НРВ(09:00-16:00,пт14:45)'
    },
    {
      value: 'N40R0074',
      label: 'НРВ(09:00-18:00, -16:45)'
    },
    {
      value: 'N40R0075',
      label: 'НРВ(09:00-15:00,пт13:45)'
    },
    {
      value: 'N40R0076',
      label: 'НВР(09:00-17:00,пт14:45)'
    },
    {
      value: 'N40R0077',
      label: 'НРВ(09:00-09:05,пт09:04)'
    },
    {
      value: 'N40R0078',
      label: 'НРВ(10:00-19:00,чт-17:00)'
    },
    {
      value: 'N40R0079',
      label: 'НРВ,КРМначРД(10:00-19:00)'
    },
    {
      value: 'N40R0080',
      label: 'НРВ,КРМконРД(10:00-19:00)'
    },
    {
      value: 'N40R0081',
      label: 'НРВ,КРМначРД(09:00-17:45)'
    },
    {
      value: 'N40R0082',
      label: 'НРВ,КРМконРД(09:00-17:45)'
    },
    {
      value: 'N40R0083',
      label: 'НРВ,КРМначРД(9:-18:,пт15:'
    },
    {
      value: 'N40R0084',
      label: 'НРВ,КРМконРД(9:-18:,пт15:'
    },
    {
      value: 'N40R0085',
      label: '40,КРМначРД(9:-18:,пт16:'
    },
    {
      value: 'N40R0086',
      label: '40,КРМконРД(9:-18:,пт16:'
    },
    {
      value: 'N40R0087',
      label: 'НРВ,КРМначРД(9:-16:,пт15:'
    },
    {
      value: 'N40R0088',
      label: 'НРВ,КРМконРД(9:-16:,пт15:'
    },
    {
      value: 'N40R0089',
      label: '40,КРМначРД(9:30-18:30)'
    },
    {
      value: 'N40R0090',
      label: '40,КРМконРД(9:30-18:30)'
    },
    {
      value: 'N40R0091',
      label: 'НРВ,КРМначРД(пн,ср,пт)'
    },
    {
      value: 'N40R0092',
      label: 'НРВ,КРМначРД(пн,ср,пт)'
    },
    {
      value: 'N40R0093',
      label: 'НРВ,КРМначРД(09:00-17:00)'
    },
    {
      value: 'N40R0094',
      label: 'НРВ,КРМконРД(09:00-17:00)'
    },
    {
      value: 'N40R0095',
      label: 'НРВ,КРМначРД(09:00-14:00)'
    },
    {
      value: 'N40R0096',
      label: 'НРВ,КРМконРД(09:00-14:00)'
    },
    {
      value: 'N40R0097',
      label: 'НРВ,КРМначРД(09:00-18:00)'
    },
    {
      value: 'N40R0098',
      label: 'НРВ,КРМконРД(09:00-18:00)'
    },
    {
      value: 'N40R0099',
      label: 'НРВ,КРМначРД(10:00-18:30)'
    },
    {
      value: 'N40R0100',
      label: 'НРВ,КРМконРД(10:00-18:30)'
    },
    {
      value: 'N40R0101',
      label: ''
    },
    {
      value: 'N40R0102',
      label: 'НРВ(09:00-17:30,пт16:15)'
    },
    {
      value: 'N40R0103',
      label: '40(07:45-16:45,пт15:30)'
    },
    {
      value: 'N40R0105',
      label: '37,5ч/40 НРВ'
    },
    {
      value: 'N40R0111',
      label: 'Неп.раб.день 20ч30мин/нед'
    },
    {
      value: 'N40R0112',
      label: 'Неп.раб.день 26 ч/неделю'
    },
    {
      value: 'N40R0113',
      label: 'Неп.раб.нед. 32,5 ч/нед.'
    },
    {
      value: 'N40R0114',
      label: '40(1100-1900,пт0930-1715)'
    },
    {
      value: 'N40R0115',
      label: '40(08:20-17:15,пт16:25)'
    },
    {
      value: 'N40R0116',
      label: 'Неп.раб.нед. 38,25 ч/нед'
    },
    {
      value: 'N40R0118',
      label: 'Неп.раб.день 39 ч/неделю'
    },
    {
      value: 'N40R0121',
      label: '40ч;4х9-18;1х12:15-20:00'
    },
    {
      value: 'N40R0122',
      label: '40;8-17;ср11-20;пт8-15:45'
    },
    {
      value: 'N40R0124',
      label: '40(09:00-18:00,пт17:00)'
    },
    {
      value: 'N40R0125',
      label: 'ПнЧт9-14;Пт9-12:45;45;60о'
    },
    {
      value: 'N40R0126',
      label: 'Полный.раб.день 40ч/в нед'
    },
    {
      value: 'N40R0127',
      label: 'Пн-Чт;9-18;45;Пт-Вс Вых'
    },
    {
      value: 'N40R0128',
      label: '38(Жен.кормл.08:00-16:30)'
    },
    {
      value: 'N40R0129',
      label: 'Неп.раб.день 38ч/в неделю'
    },
    {
      value: 'N40R0130',
      label: 'НРД 24ч 45 мин/в неделю'
    },
    {
      value: 'N40R0131',
      label: 'Офис (10.00-16.30)'
    },
    {
      value: 'N40R0133',
      label: 'Офис (08:45-17:45)'
    },
    {
      value: 'N40R0134',
      label: 'Неп.раб.нед. 39 ч/нед.'
    },
    {
      value: 'N40R0135',
      label: '40ч,7:15-16:15,45,СрВсВых'
    },
    {
      value: 'N40R0136',
      label: '20ч30мин(пн,чт,пт),45мин'
    },
    {
      value: 'N40R0137',
      label: '28ч/н, 09:00-17:00, 60'
    },
    {
      value: 'N40R0138',
      label: '32ч/н, 09:00-18:00, 3вых'
    },
    {
      value: 'N40R0139',
      label: 'НРВ(пн 9-16,вт-пт 9-18)'
    },
    {
      value: 'N40R0140',
      label: '18,5 (пн,чт 08:00-18:00)'
    },
    {
      value: 'N40R0141',
      label: 'Неп.раб.нед. 38,25 ч/нед.'
    },
    {
      value: 'N40R0142',
      label: 'НРВ_пн-ср09-15чт16пт16:45'
    },
    {
      value: 'N40R0143',
      label: 'НРВ_оф(пн-чт:10:00-19:00)'
    },
    {
      value: 'N40R0144',
      label: 'НРВ_КорПнЧт900-1800Пт1700'
    },
    {
      value: 'N40R0145',
      label: '08:00-17:00;Пт09:00-16:45'
    },
    {
      value: 'N40R0146',
      label: '40ч.08:45-18:15.Чт-4ч'
    },
    {
      value: 'N40R0147',
      label: '39ч. 09:00-17:45 (60о)'
    },
    {
      value: 'N40R0148',
      label: 'Неп.раб.д. 38ч/в 60м.корм'
    },
    {
      value: 'N40R0149',
      label: '40(08:45-18:00,пт15:30)'
    },
    {
      value: 'N40R0150',
      label: 'ср-сб10:00-19:00;вск17:45'
    },
    {
      value: 'N40R0151',
      label: 'пнср10-19втчт09-18пт10-17'
    },
    {
      value: 'N40R0152',
      label: 'НРпн-чт08:00-17:00пт14:45'
    },
    {
      value: 'S20FREE0',
      label: 'СУММИРОВАННЫЙ 20 часов'
    },
    {
      value: 'S35FREE0',
      label: 'СУММИРОВАННЫЙ 35 часов'
    },
    {
      value: 'S36FREE0',
      label: 'СУММИРОВАННЫЙ 36 часов'
    },
    {
      value: 'S40FREE0',
      label: 'СУММИРОВАННЫЙ 40 часов'
    }
  ]
};
