export const MESSAGES = {
  REQUIRED_FIELD: 'Это обязательное поле',
  REQUIRED_ROLES: 'Необходимо выбрать хотя бы одну роль',
  REQUIRED_PERMISSIONS: 'Необходимо выбрать хотя бы одну АС',
  REQUIRED_BLOCK_PERMISSIONS: 'Необходимо выбрать хотя бы одно подразделение',
  REQUIRED_USERS: 'Необходимо выбрать хотя бы одного сотрудника',
  NOT_AUTHENTICATED: 'Вы не авторизованы. Сейчас вы будете переадресованы',
  ROLES_CONFLICT: 'Некоторые роли несовместимы. Были оставлены роли с бОльшими полномочиями'
};
